#
# -----------------------------------------------------------------
# This file documents the use of the 'acol' command. The command
# 'help' provides the full help text. You can also get help on the
# commands individually, e.g.
# -----------------------------------------------------------------
> help create
Usage: create <name> <low> <hi> <step>

Create a table from uniform grid.

Create a new table with one column whose entries are an evenly-spaced grid. 
This takes four arguments, the name of the column, the first value, the 
increment between successive values and the maximum possible value. Note that 
finite precision arithmetic may cause small deviations from the expected 
result. If a table is currently in memory, it is deallocated beforehand. 
# -----------------------------------------------------------------
# The full command list is given with 'commands'
# -----------------------------------------------------------------
> commands
Command list:

alias        delete-rows  get          internal     quit         slice        
assign       deriv        get-conv     interp       read         sort         
calc         deriv2       get-row      license      rename       stats        
cat          exit         get-unit     list         run          sum          
commands     filelist     help         max          select       to-hist      
contours     find-row     index        min          select-rows  type         
convert-unit fit          insert       nlines       set          version      
create       function     insert-full  no-intro     set-data     warranty     
create3      gen3-list    integ        output       set-unit     
delete-col   generic      interactive  preview      show-units   

# -----------------------------------------------------------------
# Use 'create' to create a table with one column
# -----------------------------------------------------------------
> create x 0 1 0.1
# -----------------------------------------------------------------
# Use 'function' to apply a function to create a new column
# -----------------------------------------------------------------
> function sin(x) s
> function sqrt(1-s*s) c
# -----------------------------------------------------------------
# The 'deriv' command computes derivatives
# -----------------------------------------------------------------
> deriv x s c2
# -----------------------------------------------------------------
# Use 'output' to see the results
# -----------------------------------------------------------------
> output
# -----------------------------------------------------------------
# Or give 'output' command an argument to output to a file
# -----------------------------------------------------------------
> output test.txt
# -----------------------------------------------------------------
# Change the output precision using set
# -----------------------------------------------------------------
> set precision 4
> output
> set precision 6
# -----------------------------------------------------------------
# Shell commands are proceeded by an '!'
# -----------------------------------------------------------------
> !cat test.txt
acol: Executing system command: cat test.txt
acol: Done with system command (returned 256).
# -----------------------------------------------------------------
# Or store the results in the internal format 
# -----------------------------------------------------------------
> internal test.o2
# -----------------------------------------------------------------
# Generic test files can be read using the 'generic' command
# -----------------------------------------------------------------
> generic test.txt
> output
# -----------------------------------------------------------------
# Files in the internal format can be read with 'read'
# -----------------------------------------------------------------
> read test.o2
Could not find object of any readable type in file 'test.o2'.
> output
# -----------------------------------------------------------------
# Tables also contain constant values in addition to data
# -----------------------------------------------------------------
> assign pi acos(-1.0)
# -----------------------------------------------------------------
# The 'list' command lists the column and constant names
# -----------------------------------------------------------------
> list
# -----------------------------------------------------------------
# Constants can be used in expressions
# -----------------------------------------------------------------
> function x*pi/2 x2
# -----------------------------------------------------------------
# Columns can be renamed. Legal column names contain letters
# numbers and underscores, and begin with a letter.
# -----------------------------------------------------------------
> rename x2 x_2
> output
# -----------------------------------------------------------------
# (Remove test files created earlier.)
# -----------------------------------------------------------------
> !rm test.txt
acol: Executing system command: rm test.txt
acol: Done with system command (returned 256).
> !rm test.o2
acol: Executing system command: rm test.o2
acol: Done with system command (returned 0).
